testing/artillery/stress.yml
config:                             # https://artillery.io/docs/guides/guides/test-script-reference.html#The-config-Section
  target: https://ifconfig.co
  http:
    timeout: 0.5                    # a number (in seconds) https://artillery.io/docs/http-reference/#request-timeout
  phases:                           # https://artillery.io/docs/guides/guides/test-script-reference.html#Load-Phases
                                    # A phase with a duration and a constant arrival rate of a number of new VUs per second.
    - duration: 3
      arrivalRate: 2
  defaults:
    headers:
  tls:
    rejectUnauthorized: false
  variables:                        # https://artillery.io/docs/guides/guides/test-script-reference.html
    path_for_test: /json
  processor: "./printStatus.js"     # https://github.com/artilleryio/artillery/issues/650
                                    # how to log entire response (at least statusCode & body)
scenarios:
  - name: test
    beforeScenario: before          # https://artillery.io/docs/http-reference/#setting-scenario-level-hooks
                                    # https://spectrum.chat/artillery-io/general/run-js-function-before-scenario-and-add-context~18ea31cb-778f-4840-af2d-f19de8e12337
    flow:
      - get:
          url: "/json"
          sslAuth: false            # https://artillery.io/docs/guides/plugins/plugin-ssl-client-certificate-auth.html#Disabling-SSL-auth-selectively
          afterResponse: "printStatus"
      - post:
          url: "{{path_for_test}}"
          sslAuth: false
          body: >                   # https://artillery.io/docs/guides/guides/http-reference.html#GET-POST-PUT-PATCH-DELETE-requests
            {}